app/controllers/school_classes_controller.rb

  def index
    @schoolclasses = SchoolClass.all
---
SELECT "school_classes".* FROM "school_classes"

  def create
    @schoolclass = SchoolClass.new(params.require(:school_class).permit(:title, :room_number))
    @schoolclass.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "CS"], ["room_number", 111], ["created_at", "2017-06-12 21:05:06.081663"], ["updated_at", "2017-06-12 21:05:06.081663"]]

  def update
   @schoolclass = SchoolClass.find(params[:id])
   @schoolclass.update(params.require(:school_class).permit(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", nil], ["room_number", nil], ["updated_at", "2017-06-12 21:42:28.861507"], ["id", 1]]